In [ ]:
넘파이는 시간의 흐름이 처리안되는 반면, 
판다스는 시간의 흐름 개념이 추가됨

머신러닝엔 판다스 별로..
판다스는 탐색적 작업 시 자주 사용

In [73]:
import pandas as pd
#pd.Series로 해야함

In [80]:
from pandas import Series,DataFrame
#Series만 써도 됨
obj2 =Series([4,7,-5,3],index=['a','b','c','d'])

In [81]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [167]:
obj2['a']

4

In [83]:
obj2[obj2>0]

a    4
b    7
d    3
dtype: int64

In [168]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
type(sdata)

dict

In [85]:
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [170]:
'Ohio' in obj3

True

In [87]:
states=['California','Ohio','Oregon','Texas']

In [88]:
obj4 = Series(sdata,index=states)

In [89]:
obj4
#인덱스가 기준이 됨. 없는것은 NaN처리

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [90]:
data = {
    'state':['Ohio','Ohio','Ohio','Nebada','Nebada'],
    'year':[2000,2001,2002,2001,2002],
    'pop': [1.5,1.7,3.6,2.4,2.9]  
}
type(data)

dict

In [91]:
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nebada  2001  2.4
4  Nebada  2002  2.9

#### 열 접근

In [92]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nebada
4    Nebada
Name: state, dtype: object

In [172]:
frame.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [94]:
frame.describe()

             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

#### reindex

In [95]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nebada  2001  2.4
4  Nebada  2002  2.9

In [175]:
frame.index=['one','two','three','four','five']
frame

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nebada  2001  2.4
five   Nebada  2002  2.9

#### 행 접근

In [97]:
frame.ix[1] #과거..이제 안씀

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

state    Ohio
year     2001
pop       1.7
Name: two, dtype: object

In [98]:
frame.iloc[1] #물리적인 인덱싱 할 때 iloc

state    Ohio
year     2001
pop       1.7
Name: two, dtype: object

In [99]:
frame.loc['one'] #논리적 인덱싱 할 때 loc

state    Ohio
year     2000
pop       1.5
Name: one, dtype: object

In [113]:
frame2 = frame.copy()
frame2.drop(['pop'],axis=1)

        state  year
one      Ohio  2000
two      Ohio  2001
three    Ohio  2002
four   Nebada  2001
five   Nebada  2002

In [177]:
frame['two':'four']

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nebada  2001  2.4

In [133]:
frame.iloc[[0,2,4]]

        state  year  pop
one      Ohio  2000  1.5
three    Ohio  2002  3.6
five   Nebada  2002  2.9

In [135]:
frame.loc[['one','three','five']]

        state  year  pop
one      Ohio  2000  1.5
three    Ohio  2002  3.6
five   Nebada  2002  2.9

In [116]:
frame.loc['four']

state    Nebada
year       2001
pop         2.4
Name: four, dtype: object

In [179]:
frame[frame['pop']>2.3]  #이렇게 쓰기

        state  year  pop
three    Ohio  2002  3.6
five   Nebada  2002  2.9

In [154]:
frame.pop

DataFrame.pop

In [155]:
import numpy as np
data = DataFrame(np.arange(16).reshape((4,4)),
                index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])

In [157]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [159]:
?DataFrame.pop

In [161]:
frame3 = DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
frame3

               b         d         e
Utah   -0.232335  1.343294 -1.127602
Ohio   -0.580606  1.532116  0.323251
Texas  -0.886259  0.564808 -1.146833
Oregon -0.634143 -1.203257 -0.967284

In [180]:
f=lambda x:x.max()-x.min()
frame3.apply(f,axis=0)

b    0.653924
d    2.735373
e    1.470084
dtype: float64

In [165]:
frame3.apply(f,axis=1)

Utah      2.470895
Ohio      2.112722
Texas     1.711641
Oregon    0.569114
dtype: float64